/*
==================================================================================================================

ما گاها در برنامه نویسی با مسائلی روبه رو می شویم که این مسائل باید به صورت سکنشوآل یا پشت سر هم بیان و بررسی بشوند
برای مسال وقتی یک کاربر وارد سایت ما میشه یک کلیک رو انجام میده تایپ کلیک رو داریم و اکشن اون یا یک فرم رو سابمیت کرد
تایپ فرم رو داریم و سابمیت اون فرم رو

استفاده بکنیم if else  switch case  خوب راه حل ابتدایی که ما انجام میدهیم این هستش که ما میتونیم بیایم و از 

ما با استفاده از این دیزاین پترن کد هامون رو وارد یک زنجیره ای از حلقه میکنیم که هر کدوم از این حلقه ها  یا زنجیره ها یک کار رو برامون انجام میدهند

زنجیره ای از عملیات ها که هر کدوم میان و یک کاری رو انجام میدهند و یک زنجیره ای از حلقه هارو برامون ایجاد میکنه

فرق این دیزاین پترن با دیزاین پترن پایپ لاین در این هستش که در این دومی ما میایم و دیتا هامون رو تغیر میدهیم ولی در اولی ما
دیتا هارو تغیر نمیدیم و فقط چک میکنیم به صورت مجزا  و برای ولیدشن استفاده میکنیم


==================================================================================================================
*/
